---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceCadobjectid
source: html/1bad8245-4688-4a9f-b31e-b2aeb7131d4f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisSurfaceCadobjectid Property

"CADObjectID"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisSurfaceCadobjectid { get; }
```